import DefaultPhoto from '../assets/images/default-photo.jpg';

export const MAX_IMAGE_SIZE = 4000000;
export const DEFAULT_PHOTO = DefaultPhoto;
export const BACK_URL = '';

export const videoURL = 'https://media.w3.org/2010/05/sintel/trailer_hd.mp4';
export const mainPageText = {
  capability: {
    games: {
      info:
        'Специально для приложения разработаны 4 мини-игры - "Саванна", "Спринт", "Аудиовызов" и "Конструктор слов". С их помощью запоминать слова гораздо проще!',
      title: 'Мини-игры',
      subTitle: 'Играй и учись!',
    },
    dictionary: {
      info:
        'Зарегистрируйся и открой доступ к своим словам! Играй в игры, собирай слова, сортируй их по категориям - всё для успешного изучения!',
      title: 'Словарь',
      subTitle: 'Адаптируй под себя!',
    },
    statistic: {
      info:
        'Какая у тебя сегодня самая длинная серия правильных ответов? Сколько слов ты выучил за сегодня? На эти и другие вопросы ты найдешь ответы на странице статистики. После регистрации - статистика за месяц и с иллюстрациями!',
      title: 'Статистика',
      subTitle: 'Наблюдай за прогрессом!',
    },
  },
  about: {
    Andrey: 'Бэкенд\nмини-игра "Саванна"',
    Eugenia: 'Мини-игра "Спринт"',
    Inna: 'Дизайн\nучебник',
    Julia: 'Авторизация\nмини-игра "Аудиовызов"',
    Samvel: 'Главная страница\nмини-игра "Конструктор слов"',
  },
};
